/**
 * --------------------------------
 * JavaScript Core
 * --------------------------------
 * 절차 방식으로 학습
 * 기초 문법부터 차근차근
 * 복습! 복습! 복습!
 * ----------------------------- */

// 실행 구문 1

// 변수 x 에 숫자 10 상수 값을 대입
x = 10;
// 변수 y의 연산 결과는
// 변수 x에 숫자 10을 더한 값이다.
y = x + 10; // 20

// 변수 z에 변수 y를 활용한 수식 적용
z = y * y - 100;

// 콘솔(console)에 기록(log)하고 싶다.
console.log('x:', x); // x = 10
console.log('y:', y); // y = 20
console.log('z:', z); // z = 300

// --------------------------------

// 실행 구문 2

// 변수의 상태가 변경되었다.
x = -19;

y = x + 10; // ????

console.log('x:', x); // x = -19
console.log('y:', y); // y = -19 + 10 = -9
console.log('z:', z); // z = ????